Autodesk.Revit.DB.Mechanical.OccupancyUnit
An enumerated type listing the occupancy unit of measure for a space object.

Autodesk.Revit.DB.Mechanical.OccupancyUnit.AreaPerPerson
OccupancyUnit is AreaPerPerson.

Autodesk.Revit.DB.Mechanical.OccupancyUnit.NumberOfPeople
OccupancyUnit is NumberOfPeople.

Autodesk.Revit.DB.Mechanical.OccupancyUnit.BySpaceType
OccupancyUnit is BySpaceType.

Autodesk.Revit.DB.Mechanical.OccupancyUnit.UseDefaultValues
OccupancyUnit is UseDefaultValues. Obsoleted from 2018, use BySpaceType instead.